In [97]:
import pandas as pd
from ast import literal_eval

In [98]:
# Read the data into a Pandas DataFrame
keywords_df = pd.read_csv("Resources/keywords.csv")

keywords_df

           id                                           keywords
0         862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1        8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2       15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3       31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4       11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...       ...                                                ...
46414  439050             [{'id': 10703, 'name': 'tragic love'}]
46415  111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416   67758                                                 []
46417  227506                                                 []
46418  461257                                                 []

[46419 rows x 2 columns]

In [99]:
# Rename "id" column to "movie_id" so it won't be confused with other id numbers
keywords_df.rename(columns={"id":"movie_id"}, inplace=True)

keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416     67758                                                 []
46417    227506                                                 []
46418    461257                                                 []

[46419 rows x 2 columns]

In [100]:
# Drop empty rows
# code example from https://sparkbyexamples.com/pandas/pandas-delete-rows-based-on-column-value/

keywords_df.drop(keywords_df[keywords_df["keywords"] == "[]"].index, inplace=True)

In [101]:
keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46409     84419  [{'id': 9748, 'name': 'revenge'}, {'id': 9826,...
46410    390959            [{'id': 224180, 'name': 'blair witch'}]
46411    289923  [{'id': 616, 'name': 'witch'}, {'id': 2035, 'n...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...

[31624 rows x 2 columns]

In [102]:
# explode list of dictionaries to one dictionary per line
# solution from https://stackoverflow.com/questions/65621510/how-to-split-a-pandas-column-with-a-list-of-dicts-into-separate-columns-for-each
keywords_df.keywords = keywords_df.keywords.apply(literal_eval)
keywords_df = keywords_df.explode("keywords", ignore_index=True)

keywords_df

        movie_id                               keywords
0            862        {'id': 931, 'name': 'jealousy'}
1            862            {'id': 4290, 'name': 'toy'}
2            862            {'id': 5202, 'name': 'boy'}
3            862     {'id': 6054, 'name': 'friendship'}
4            862        {'id': 9713, 'name': 'friends'}
...          ...                                    ...
158675    289923  {'id': 11800, 'name': 'mockumentary'}
158676    439050   {'id': 10703, 'name': 'tragic love'}
158677    111109         {'id': 2679, 'name': 'artist'}
158678    111109          {'id': 14531, 'name': 'play'}
158679    111109        {'id': 215397, 'name': 'pinoy'}

[158680 rows x 2 columns]

In [103]:
# split dictionary into separate columns
# solution from https://www.skytowner.com/explore/splitting_dictionary_into_separate_columns_in_pandas_dataframe
keywords_df = pd.concat([keywords_df, keywords_df["keywords"].apply(pd.Series)], axis=1)

keywords_df

        movie_id                               keywords      id          name
0            862        {'id': 931, 'name': 'jealousy'}     931      jealousy
1            862            {'id': 4290, 'name': 'toy'}    4290           toy
2            862            {'id': 5202, 'name': 'boy'}    5202           boy
3            862     {'id': 6054, 'name': 'friendship'}    6054    friendship
4            862        {'id': 9713, 'name': 'friends'}    9713       friends
...          ...                                    ...     ...           ...
158675    289923  {'id': 11800, 'name': 'mockumentary'}   11800  mockumentary
158676    439050   {'id': 10703, 'name': 'tragic love'}   10703   tragic love
158677    111109         {'id': 2679, 'name': 'artist'}    2679        artist
158678    111109          {'id': 14531, 'name': 'play'}   14531          play
158679    111109        {'id': 215397, 'name': 'pinoy'}  215397         pinoy

[158680 rows x 4 columns]

In [104]:
# drop unneccessary columns
clean_keywords_df = keywords_df.drop(columns=["keywords","id"])

# rename keyword column
clean_keywords_df.rename(columns={"name":"keyword"}, inplace=True)

clean_keywords_df

        movie_id       keyword
0            862      jealousy
1            862           toy
2            862           boy
3            862    friendship
4            862       friends
...          ...           ...
158675    289923  mockumentary
158676    439050   tragic love
158677    111109        artist
158678    111109          play
158679    111109         pinoy

[158680 rows x 2 columns]

In [105]:
# create column with number of times the keyword appears in the column
# solution from https://stackoverflow.com/questions/22391433/count-the-frequency-that-a-value-occurs-in-a-dataframe-column
clean_keywords_df["occurrence"]=clean_keywords_df.keyword.map(clean_keywords_df.keyword.value_counts())

In [106]:
clean_keywords_df.sort_values("occurrence").head(50)

        movie_id                             keyword  occurrence
8142        9964                        testosterone           1
97740      36172                             cabbage           1
52562       8983                              revier           1
6816         500                    heist gone wrong           1
97739      36172           climbing through a window           1
97738      36172                           snowflake           1
6819         500                              iconic           1
97741      36172                 jumping into a pool           1
6820         500                     set in one room           1
84408      41733                           rest stop           1
148946    356895                         kew gardens           1
84409      41733                             vicodin           1
84410      41733                              waffle           1
97728      77875                        penalty kick           1
20078       9008  columbia broadcasting system (cbs)           1
6822         500                       rag tag group           1
97742      36172                lifted by the throat           1
133327    129851                     crooked sheriff           1
148947    356895                      kitty genovese           1
118147     48635                               heavy           1
97781      68718                         black slave           1
148960    301334           title spoken by character           1
148959    301334        screenplay adapted by author           1
42173      40423                            carnaval           1
32577      11333                                 rot           1
130032    266433                         solar storm           1
140633    334495                       trail running           1
6801          88                     catskill resort           1
148958    301334                       topless woman           1
118139    104638                            far west           1
148951    356895                        indifference           1
148950    356895                    bystander effect           1
148949    356895                   genovese syndrome           1
84400      41439                      prosthetic arm           1
42198      37749                         singles bar           1
84413     182756                     self confidence           1
84414     182756                         rediscovery           1
84415     182756                        rejuvenation           1
140684    361181                              komedi           1
133322    129847                            fake nun           1
42233      10023                                yugo           1
84556      14234                              pillow           1
133321    129847                saved from execution           1
84560      41123                      lourdes france           1
111753     41077                            porridge           1
97686      83186                             arthaus           1
84578     137504                         poor family           1
111754     41077                         hollow tree           1
42249      42238                  german colonialism           1
52451      14135                             groping           1